## **Assignment - 4**

1. Write an SQL query to print the FIRST_NAME from Worker table after replacing ‘a’ with ‘A’.



```

SELECT First_Name, 
REPLACE(First_Name, 'a', 'A') as 'Replaced Name'
FROM Worker

```

2. Write an SQL query to print all Worker details from the Worker table order by
FIRST_NAME Ascending and DEPARTMENT Descending.



```

SELECT * 
FROM Worker
ORDER BY First_Name,
Department DESC



```

3. Write an SQL query to fetch the names of workers who earn the highest salary.



```

SELECT First_Name,
Salary
FROM Worker
WHERE Salary = (SELECT MAX(Salary) FROM Worker)


```